WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
    item_value.value = malloc(value_size);
    if (item_value.value == NULL)
    {
        return ERROR;        
    }
    memcpy(item_value.value, value, value_size);
    item_value.item = item;
    item_value.value_length = value_size;
    int payload_length = espcp_configuration_value_buffer_size(&item_value);
    uint8_t *payload = malloc(payload_length);
    if (payload == NULL)
    {
        free(item_value.value);
        return(ERROR);
    }
    espcp_encode_configuration_value(&item_value, payload);
    free(item_value.value);
    espcp_message_t *message = espcp_create_message_on_heap(espcp_message_types_header, espcp_esp32_interfaces_system,
                                                            espcp_system_function_set_configuration_item, espcp_status_codes_completed_ok,
                                                            espcp_get_next_message_id(), payload, payload_length);
    if (message == NULL)
    {
        free(payload);
        return(ERROR);
    }

    int result = ERROR;
    if (espcp_queue_message(message, true) == espcp_status_codes_completed_ok)
    {
        if (message->status_code == espcp_status_codes_completed_ok)
        {
            result = OK;
        }
    }
    espcp_delete_message_and_payload(message);
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_set_esp_integer_value
 *
 * Description:
 *  Set an integer value on the ESP32.
 * 
 * Input Parameters:
 *  item - type of item to be set.
 *  value - value to be set.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_set_esp_integer_value(espcp_configuration_items_t item, uint32_t value)
{
    return(hcom_nx_config_set_esp_value(item, (uint8_t *) &value, 4));
}

/****************************************************************************
 * Name: hcom_nx_config_set_esp_boolean_value
 *
 * Description:
 *  Set a boolean value on the ESP32.
 * 
 * Input Parameters:
 *  item - type of item to be set.
 *  value - value to be set.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_t item, uint8_t value)
{
    return(hcom_nx_config_set_esp_value(item, (uint8_t *) &value, 1));
}

/****************************************************************************
 * Name: hcom_nx_config_set_device_name
 *
 * Description:
 *  Set the a string configuration value on the ESP32.
 * 
 * Input Parameters:
 *  item - type of item to be set.
 *  value - value to be set.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_set_esp_string_value(espcp_configuration_items_t item, const char *value)
{
    int result;

    if (value != NULL)
    {
        result = hcom_nx_config_set_esp_value(item, (uint8_t *) value, strlen(value) + 1);
    }
    else
    {
        result = ERROR;
    }
    return(result);
}   

/****************************************************************************
 * Name: hcom_nx_config_set_device_name
 *
 * Description:
 *  Set the device name.
 * 
 *  If the device name is invalid then set the device name to the default
 *  value (MeadowF7).
 *
 * Input Parameters:
 *  config - pointer to the configuration structure.
 *  device_name - New name for the device.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_set_device_name(meadow_configuration_t *config, const char *device_name)
{
    char *new_name = NULL;
    if (!hcom_nx_config_is_valid_host_name(device_name))
    {
        new_name = strdup(MEADOW_CONFIG_DEFAULT_DEVICE_NAME);
    }
    else
    {
        new_name = strdup(device_name);
    }
    if (config->device_name != NULL)
    {
        free(config->device_name);
    }
    config->device_name = new_name;
    sethostname(config->device_name, strlen(config->device_name));
}

/****************************************************************************
 * Name: hcom_nx_read_configuration_file
 *
 * Description:
 *  Read the current configuration from flash and populate the configuration
 *  object.
 *
 * Input Parameters:
 *  None
 *
 * Returned Value:
 *  Pointer to the newly populated configuration object or NULL if there was
 *  a problem.
 *
 * Assumptions/Limitations:
 *  This method is only allowed to be called once to read the configuration
 *  at startup.  Duplicate calls to this method simply return the current
 *  value of the meadow_configuration pointer and take no other action.
 *
 ****************************************************************************/
static meadow_configuration_t *hcom_nx_read_configuration_file(void)
{
    hcom_nx_config_lock();
    if (meadow_configuration == NULL)
    {
        meadow_configuration = (meadow_configuration_t *) malloc(sizeof(meadow_configuration_t));
        if (meadow_configuration != NULL)
        {
        	yaml_configuration_t *configuration;

            memset(meadow_configuration, 0, sizeof(meadow_configuration_t));
            cyaml_err_t err = cyaml_load_file(MEADOW_CONFIG_DEFAULT_FILE_NAME, &cyaml_config, &configuration_schema, (void **) &configuration, NULL);
            if (err != CYAML_OK)
            {
                meadow_configuration->using_default_configuration = 1;
                meadow_configuration->reset_esp32_at_startup = 1;
                meadow_configuration->esp_spi_speed = 8000000;
                meadow_configuration->maximum_retry_count = 3;
                syslog(LOG_INFO, "%s@%d Unable to process configuration file, using system defaults.\n", thisFile, __LINE__);
            }
            else
            {
                if (configuration->mono_control != NULL)
                {
                    if (configuration->mono_control->trace != NULL)
                    {
                        meadow_configuration->mono_trace = strdup(configuration->mono_control->trace);
                    }
                    meadow_configuration->mono_debug = configuration->mono_control->debug;
                    meadow_configuration->disable_mono = configuration->mono_control->disable;
                }
                //
                if (configuration->coprocessor != NULL)
                {
                    meadow_configuration->reset_esp32_at_startup = !configuration->coprocessor->debugger_attached;
                    meadow_configuration->esp_spi_speed = configuration->coprocessor->spi_speed;
                    meadow_configuration->automatically_reconnect_to_access_point = configuration->coprocessor->automatically_reconnect_to_access_point;
                    meadow_configuration->automatically_start_wifi = configuration->coprocessor->automatically_start_wifi;
                }
                else 
                {
                    meadow_configuration->reset_esp32_at_startup = 1;
                    meadow_configuration->esp_spi_speed = 8000000;
                }
                if (configuration->network != NULL)
                {
                    meadow_configuration->get_network_time_at_startup = configuration->network->get_network_time_at_startup;
                    if (configuration->network->network_time_server != NULL)
                    {
                        meadow_configuration->network_time_server = strdup(configuration->network->network_time_server);
                    }
                }
                if (configuration->debug != NULL)
                {
                    meadow_configuration->trace_level = configuration->debug->trace_level;
                    meadow_configuration->use_uart1_for_trace = (strcmp(configuration->debug->uart1_use, "trace") == 0);
                }
                //
                if (configuration->device_name != NULL)
                {
                    meadow_configuration->device_name = strdup(configuration->device_name);
                }
                //
                meadow_configuration->esp_software_version = NULL;
            }

            cyaml_free(&cyaml_config, &configuration_schema, configuration, 0);
        }
    }

    hcom_nx_config_unlock();
    return(meadow_configuration);
}

/****************************************************************************
 * Name: hcom_nx_copy_string
 *
 * Description:
 *  Copy a string into the buffer and return the amount of storage used to
 *  store the string and its terminating 0.
 *
 * Input Parameters:
 *  source - String to be copied.
 *  destination - Memory to hold the copy of the string.
 *
 * Returned Value:
 *  Amount of memory consumed by the string and its terminating 0.
 *
 * Assumptions/Limitations:
 *  The destination buffer is large enough to hold tha copy of the string.
 *
 ****************************************************************************/
int hcom_nx_copy_string(char *source, char *destination)
{
    int length = 0;

    if (source == NULL)
    {
        *destination = 0;
    }
    else
    {
        length = strlen(source);
        strcpy(destination, source);
    }

