WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
    if (buffer_length > 16)
    {
        result = snprintf((char *) buffer, buffer_length, "%d.%d.%d.%d", (config->mono_version >> 24) & 0xff, (config->mono_version >> 16) & 0xff,
                            (config->mono_version >> 8) & 0xff, config->mono_version & 0xff);
    }
    else
    {
        result = ERROR;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_automatically_connect_to_network
 *
 * Description:
 *  Get the AutomaticallyConnectToNetwork property from the ESP configuration.
 *
 * Input Parameters:
 *  buffer - Buffer to hold the Mono version string.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_get_automatically_connect_to_network(uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (buffer_length > 0)
    {
        hcom_nx_config_lock();
        meadow_configuration_t *config = hcom_nx_get_configuration();
        if (config != NULL)
        {
            *buffer = config->automatically_start_wifi ? 1 : 0;
            result = 1;
        }
        hcom_nx_config_unlock();
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_automatically_reconnect
 *
 * Description:
 *  Get the AutomaticallyReconnect property from the ESP configuration.
 *
 * Input Parameters:
 *  buffer - Buffer to hold the Mono version string.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_get_automatically_reconnect(uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (buffer_length > 0)
    {
        hcom_nx_config_lock();
        meadow_configuration_t *config = hcom_nx_get_configuration();
        if (config != NULL)
        {
            *buffer = config->automatically_reconnect_to_access_point ? 1 : 0;
            result = 1;
        }
        hcom_nx_config_unlock();
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_get_time_at_startup
 *
 * Description:
 *  Get the GetTimeAtStartup property from the ESP configuration.
 *
 * Input Parameters:
 *  buffer - Buffer to hold the Mono version string.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_get_get_time_at_startup(uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (buffer_length > 0)
    {
        hcom_nx_config_lock();
        meadow_configuration_t *config = hcom_nx_get_configuration();
        if (config != NULL)
        {
            *buffer = config->get_network_time_at_startup ? 1 : 0;
            result = 1;
        }
        hcom_nx_config_unlock();
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_ntp_server
 *
 * Description:
 *  Get the address of any configured NTP server.
 *
 * Input Parameters:
 *  buffer - Buffer to hold the NTP server name
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_ntp_server(uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    hcom_nx_config_lock();
    meadow_configuration_t *config = hcom_nx_get_configuration();
    if ((config != NULL) && (config->network_time_server != NULL))
    {
        result = hcom_nx_config_get_string_value(config->network_time_server, buffer, buffer_length);
    }
    hcom_nx_config_unlock();

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_maximum_retry_count
 *
 * Description:
 *  Get the maximum number of times a retry operation will be attempted.
 *
 * Input Parameters:
 *  buffer - Buffer to hold the maximum retry count.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_maximum_retry_count(uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    hcom_nx_config_lock();
    meadow_configuration_t *config = hcom_nx_get_configuration();
    if (config != NULL)
    {
        result = hcom_nx_config_get_bytes((uint8_t *) &config->maximum_retry_count, sizeof(int), buffer, buffer_length);
    }
    hcom_nx_config_unlock();

    return(result);
}

/****************************************************************************
 * Name: hxom_nx_config_get_board_mac_address
 *
 * Description:
 *  Get the MAC address of the board (ESP32 MAC address).
 *
 * Input Parameters:
 *  buffer - Buffer to hold the MAC address
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_board_mac_address(uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    hcom_nx_config_lock();
    meadow_configuration_t *config = hcom_nx_get_configuration();
    if (config != NULL)
    {
        result = hcom_nx_config_get_bytes(config->board_mac_address, sizeof(config->board_mac_address), buffer, buffer_length);
    }
    hcom_nx_config_unlock();

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_soft_ap_mac_address
 *
 * Description:
 *  Get the soft access point MAC address of the ESP32 chip.
 *
 * Input Parameters:
 *  buffer - Buffer to hold the soft access point MAC address
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_soft_ap_mac_address(uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    hcom_nx_config_lock();
    meadow_configuration_t *config = hcom_nx_get_configuration();
    if (config != NULL)
    {
        result = hcom_nx_config_get_bytes(config->soft_ap_mac_address, sizeof(config->soft_ap_mac_address), buffer, buffer_length);
    }
    hcom_nx_config_unlock();

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_set_config_value
 *
 * Description:
 *  Read or write a configuration value.
 *
 * Input Parameters:
 *  item - Value to be accessed.
 *  direction - Read (0) or write (1).
 *  buffer - Buffer to hold the value when reading, or holding the new value
 *           when writing.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_get_set_config_value(int item, uint8_t direction, uint8_t *buffer, int buffer_length)
{
    int result;

    hcom_nx_config_lock();
    meadow_configuration_t *config = hcom_nx_get_configuration();
    switch (item)
    {
        case cv_device_name:
            result = hcom_nx_config_get_string_value(config->device_name, buffer, buffer_length);
            break;
        case cv_product:
            result = hcom_nx_config_get_string_value(config->meadow_hardware_version, buffer, buffer_length);
            break;
        case cv_model:
            result = hcom_nx_config_get_string_value(HCOM_DEVICE_INFO_MODEL, buffer, buffer_length);
            break;
        case cv_os_version:
            result = hcom_nx_config_get_string_value(config->meadow_software_version, buffer, buffer_length);
            break;
        case cv_build_date:
            result = hcom_nx_config_get_string_value(__DATE__ " " __TIME__, buffer, buffer_length);
            break;
        case cv_processor_type:
            result = hcom_nx_config_get_string_value(HCOM_DEVICE_INFO_PROCESSOR_TYPE, buffer, buffer_length);
            break;
        case cv_unique_id:
            result = hcom_nx_config_get_unique_id(config, buffer, buffer_length);
            break;
        case cv_serial_number:
            result = hcom_nx_config_get_serial_number(config, buffer, buffer_length);
            break;
        case cv_coprocessor_type:
            result = hcom_nx_config_get_string_value(HCOM_DEVICE_INFO_COPROCESSOR_TYPE, buffer, buffer_length);
            break;
        case cv_coprocessor_firmware_version:
            result = hcom_nx_config_get_coprocessor_firmware_version(config, buffer, buffer_length);
            break;
        case cv_mono_version:
            result = hcom_nx_config_get_mono_version(config, buffer, buffer_length);
            break;
        case cv_automatically_start_network:
            result = hcom_nx_config_get_automatically_connect_to_network(buffer, buffer_length);
            break;
        case cv_automatically_reconnect:
            result = hcom_nx_config_get_automatically_reconnect(buffer, buffer_length);
            break;
        case cv_maximum_network_retry_count:
            result = hcom_nx_config_get_maximum_retry_count(buffer, buffer_length);
            break;
        case cv_get_time_at_startup:
            result = hcom_nx_config_get_get_time_at_startup(buffer, buffer_length);
            break;
        case cv_ntp_server:
            result = hcom_nx_config_get_ntp_server(buffer, buffer_length);
            break;
        case cv_mac_address:
            result = hcom_nx_config_get_board_mac_address(buffer, buffer_length);
            break;
        case cv_soft_ap_mac_address:
            result = hcom_nx_config_get_soft_ap_mac_address(buffer, buffer_length);
            break;
        default:
            result = ERROR;
            break;
    }
    hcom_nx_config_unlock();
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_process_esp_configuration
 *
 * Description:
 *  Compare the incooming ESP configuration with the current configuration
 *  read from the configuration file.  The configuration file is considered
 *  to be the source of truth.
 * 
 *  Send any differences over to the ESP32.
 *
 * Input Parameters:
 *  esp_config - Configuration stored in the ESP32.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_process_esp_configuration(espcp_system_configuration_t *esp_config)
{
    hcom_nx_config_lock();
    meadow_configuration_t *configuration = hcom_nx_get_configuration();
    if (configuration != NULL)
    {
        if (configuration->automatically_start_wifi != esp_config->automatically_start_network)
        {
            hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_automatically_start_network, configuration->automatically_start_wifi == 1);
        }
        if (configuration->automatically_reconnect_to_access_point != esp_config->automatically_reconnect)
        {
            hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_automatically_reconnect, configuration->automatically_reconnect_to_access_point == 1);
        }
        if (configuration->maximum_retry_count != esp_config->maximum_retry_count)
        {
            hcom_nx_config_set_esp_integer_value(espcp_configuration_items_maximum_retry_count, configuration->maximum_retry_count);
        }
        if ((esp_config->device_name != NULL) && (strcmp(configuration->device_name, esp_config->device_name) != 0))
        {
            hcom_nx_config_set_esp_string_value(espcp_configuration_items_device_name, configuration->device_name);
        }
        if (configuration->get_network_time_at_startup != esp_config->get_time_at_startup)
        {
            hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_get_time_at_startup, configuration->get_network_time_at_startup == 1);
        }
        if (configuration->network_time_server != NULL)
        {
            if ((esp_config->ntp_server == NULL) || (strcmp(configuration->network_time_server, esp_config->ntp_server) != 0))
            {
                hcom_nx_config_set_esp_string_value(espcp_configuration_items_ntp_server, configuration->network_time_server);
            }
        }
        else
        {
            if ((esp_config->ntp_server != NULL) && (strlen(esp_config->ntp_server) != 0))
            {
                char null_str = '\0';
                hcom_nx_config_set_esp_string_value(espcp_configuration_items_ntp_server, &null_str);
            }
        }
        if (esp_config->software_version != NULL)
        {
            if (configuration->esp_software_version != NULL)
            {
                free(configuration->esp_software_version);
            }
            configuration->esp_software_version = strdup(esp_config->software_version);
        }
        else
        {
            configuration->esp_software_version = NULL;
        }
    }
    hcom_nx_config_unlock();
}

/****************************************************************************
 * Name: hcom_nx_config_init
 *
 * Description:
 *  Setup the configuration system and populate the configuration structure
 *  with data from the configuration file.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_init(void)
{
    sem_init(&config_lock, 0, 1);                   // Create the config lock.
    sem_setprotocol(&config_lock, SEM_PRIO_NONE);
    hcom_nx_read_configuration_file();

